app/Controllers/Prediksi.php

    public function index()
    {
        $total_prediksi = null;
        $selected_year = $this->request->getVar('tahun');
        $data_siswa = $this->siswaModel->getSiswaWithWilayah($selected_year);
        $available_years = $this->siswaModel->getDistinctTahun();

        if (!empty($data_siswa)) {
            usort($data_siswa, function ($a, $b) {
                return $a['cdf'] <=> $b['cdf'];
            });

            // =====================================================================
            // >> BAGIAN BARU: Memuat Hasil Prediksi yang Sudah Tersimpan <<
            // =====================================================================
            // Cek apakah ada data prediksi tersimpan untuk tahun yang dipilih
            $saved_predictions = $this->prediksiModel->where('tahun', $selected_year)->findAll();
---
SELECT *
FROM `prediksi`
WHERE `tahun` IS NULL

    public function simpan()
    {
        $dataPrediksiJson = $this->request->getPost('data_prediksi');
        $totalPrediksi = $this->request->getPost('total_prediksi');
        $dataFromView = json_decode($dataPrediksiJson, true);

        if (empty($dataFromView)) {
            return redirect()->to('prediksi')->with('error', 'Tidak ada data hasil prediksi untuk disimpan.');
        }

        $tahun_prediksi = $dataFromView[0]['tahun'];
        $updatedCount = 0;
        $insertedCount = 0;

        foreach ($dataFromView as $row) {
            $dataToSave = [
                'tahun'             => $row['tahun'],
                'kecamatan'         => $row['kecamatan'],
                'jumlah'            => $row['jumlah'],
                'probabilitas'      => $row['probabilitas'],
                'cdf'               => $row['cdf'],
                'batas'             => $row['batas'],
                'angka_acak'        => $row['angka_acak'] ?? null,
                'hasil_prediksi'    => $row['hasil_prediksi'] ?? null,
                'total_keseluruhan' => $totalPrediksi,
                'updated_at'        => date('Y-m-d H:i:s'),
            ];

            // Cek apakah data sudah ada berdasarkan tahun dan kecamatan
            $existingRecord = $this->prediksiModel
                ->where('tahun', $row['tahun'])
                ->where('kecamatan', $row['kecamatan'])
                ->first();

            if ($existingRecord) {
                // Jika data sudah ada, update record tersebut
                $this->prediksiModel->update($existingRecord['id_prediksi'], $dataToSave);
---
SELECT *
FROM `prediksi`
WHERE `tahun` = '2025'
AND `kecamatan` = 'Bandar Pasir Mandoge'
 LIMIT 1
UPDATE `prediksi` SET `tahun` = '2025', `kecamatan` = 'Bandar Pasir Mandoge', `jumlah` = '1720', `probabilitas` = '0.112', `cdf` = '0.112', `batas` = '0.000 - 0.112', `angka_acak` = 0.09375, `hasil_prediksi` = '1720', `total_keseluruhan` = '16871'
WHERE `prediksi`.`id_prediksi` IN ('1414')